Revit 2027 API
PolymeshTopology.GetNormal Method
 Returns a normal vector at the given index
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetNormal(
	int idx
)
Public Function GetNormal (
	idx As Integer
) As XYZ
public:
XYZ^ GetNormal(
	int idx
)
member GetNormal :
        idx : int -> XYZ
Parameters
idx Int32
 A zero-based index
Return Value
XYZ
 XYZ value representing a normal vector
Exceptions
Exception | Condition
ArgumentException |  The given value is not a valid index of a normal of the polymesh. A valid valure is not negative and is smaller than the number of normals in the polymesh.
See Also
Reference
PolymeshTopology Class
Autodesk.Revit.DB Namespace